# How do I use the "axis" parameter in pandas?

üêº Tuto on pandas by Data School - Exercice performed by Dorian.H Mekni ü•á | Mon 30 Nov 2020

In [1]:
import pandas as pd

In [2]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')

In [3]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa


‚≠êÔ∏è Here we want to drop the column 'continent'. This result is achieved by pointing the parameter 'axis' to 1.

In [16]:
drinks.drop('continent', axis=1).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9


‚úÖ This is a temporary removal as we did not use the 'inplace' parameter.


‚≠êÔ∏è Let's now remove a row rather than a column and see how we can perform such proceeding.

In [17]:
drinks.drop(2, axis=0).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
5,Antigua & Barbuda,102,128,45,4.9,North America


‚úÖ This was completed by indicating as first argument the index position of the row we wished to drop.


‚≠êÔ∏è We now need the mean of each numeric column.

In [18]:
drinks.mean()

beer_servings                   106.160622
spirit_servings                  80.994819
wine_servings                    49.450777
total_litres_of_pure_alcohol      4.717098
dtype: float64


‚úÖ The reason why it was executed without having to add any argument, is because the default argument for axis is 0. 0 is the axis pointing at columns'.


‚òùüèª We can also explicitly define it.

In [8]:
drinks.mean(axis=0)

beer_servings                   106.160622
spirit_servings                  80.994819
wine_servings                    49.450777
total_litres_of_pure_alcohol      4.717098
dtype: float64

In [10]:
drinks.mean(axis=0).shape

(4,)


‚≠êÔ∏è On the other hand, if we want to work out the mean of each row, the argument 'axis' would be defined as 1.

In [19]:
drinks.mean(axis=1)

0        0.000
1       69.975
2        9.925
3      176.850
4       81.225
        ...
188    110.925
189     29.000
190      1.525
191     14.375
192     22.675
Length: 193, dtype: float64

In [11]:
drinks.mean(axis=1).shape

(193,)


‚úÖ The mean for each row has been calculated.

# üé© Bonus tips : iPython | Jupyter Notebook ONLY


ü§† There is a more explicit way to define the axis depending on how you feel confortable using the previous method.

In [20]:
drinks.mean(axis='columns')

0        0.000
1       69.975
2        9.925
3      176.850
4       81.225
        ...
188    110.925
189     29.000
190      1.525
191     14.375
192     22.675
Length: 193, dtype: float64

In [24]:
drinks.mean(axis='rows')

beer_servings                   106.160622
spirit_servings                  80.994819
wine_servings                    49.450777
total_litres_of_pure_alcohol      4.717098
dtype: float64


üòâ Writting in plain letters which axis you're targeting might be easier for some !


üôèüèª Thank you !

üëãüèª See you in the next one !